Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM304.h
#define _RPINR23_SS2R6_POSITION                  0x00000006
#define _RPINR23_SS2R6_MASK                      0x00000040
#define _RPINR23_SS2R6_LENGTH                    0x00000001

#define _RPINR24_CSDIR_POSITION                  0x00000000
#define _RPINR24_CSDIR_MASK                      0x0000007F
#define _RPINR24_CSDIR_LENGTH                    0x00000007

#define _RPINR24_CSCKR_POSITION                  0x00000008
#define _RPINR24_CSCKR_MASK                      0x00007F00
#define _RPINR24_CSCKR_LENGTH                    0x00000007

#define _RPINR24_CSDIR0_POSITION                 0x00000000
#define _RPINR24_CSDIR0_MASK                     0x00000001
#define _RPINR24_CSDIR0_LENGTH                   0x00000001

#define _RPINR24_CSDIR1_POSITION                 0x00000001
#define _RPINR24_CSDIR1_MASK                     0x00000002
#define _RPINR24_CSDIR1_LENGTH                   0x00000001

#define _RPINR24_CSDIR2_POSITION                 0x00000002
#define _RPINR24_CSDIR2_MASK                     0x00000004
#define _RPINR24_CSDIR2_LENGTH                   0x00000001

#define _RPINR24_CSDIR3_POSITION                 0x00000003
#define _RPINR24_CSDIR3_MASK                     0x00000008
#define _RPINR24_CSDIR3_LENGTH                   0x00000001

#define _RPINR24_CSDIR4_POSITION                 0x00000004
#define _RPINR24_CSDIR4_MASK                     0x00000010
#define _RPINR24_CSDIR4_LENGTH                   0x00000001

#define _RPINR24_CSDIR5_POSITION                 0x00000005
#define _RPINR24_CSDIR5_MASK                     0x00000020
#define _RPINR24_CSDIR5_LENGTH                   0x00000001

#define _RPINR24_CSDIR6_POSITION                 0x00000006
#define _RPINR24_CSDIR6_MASK                     0x00000040
#define _RPINR24_CSDIR6_LENGTH                   0x00000001

#define _RPINR24_CSCKR0_POSITION                 0x00000008
#define _RPINR24_CSCKR0_MASK                     0x00000100
#define _RPINR24_CSCKR0_LENGTH                   0x00000001

#define _RPINR24_CSCKR1_POSITION                 0x00000009
#define _RPINR24_CSCKR1_MASK                     0x00000200
#define _RPINR24_CSCKR1_LENGTH                   0x00000001

#define _RPINR24_CSCKR2_POSITION                 0x0000000A
#define _RPINR24_CSCKR2_MASK                     0x00000400
#define _RPINR24_CSCKR2_LENGTH                   0x00000001

#define _RPINR24_CSCKR3_POSITION                 0x0000000B
#define _RPINR24_CSCKR3_MASK                     0x00000800
#define _RPINR24_CSCKR3_LENGTH                   0x00000001

#define _RPINR24_CSCKR4_POSITION                 0x0000000C
#define _RPINR24_CSCKR4_MASK                     0x00001000
#define _RPINR24_CSCKR4_LENGTH                   0x00000001

#define _RPINR24_CSCKR5_POSITION                 0x0000000D
#define _RPINR24_CSCKR5_MASK                     0x00002000
#define _RPINR24_CSCKR5_LENGTH                   0x00000001

#define _RPINR24_CSCKR6_POSITION                 0x0000000E
#define _RPINR24_CSCKR6_MASK                     0x00004000
#define _RPINR24_CSCKR6_LENGTH                   0x00000001

#define _RPINR25_COFSR_POSITION                  0x00000000
#define _RPINR25_COFSR_MASK                      0x0000007F
#define _RPINR25_COFSR_LENGTH                    0x00000007

#define _RPINR25_COFSR0_POSITION                 0x00000000
#define _RPINR25_COFSR0_MASK                     0x00000001
#define _RPINR25_COFSR0_LENGTH                   0x00000001

#define _RPINR25_COFSR1_POSITION                 0x00000001
#define _RPINR25_COFSR1_MASK                     0x00000002
#define _RPINR25_COFSR1_LENGTH                   0x00000001

#define _RPINR25_COFSR2_POSITION                 0x00000002
#define _RPINR25_COFSR2_MASK                     0x00000004
#define _RPINR25_COFSR2_LENGTH                   0x00000001

#define _RPINR25_COFSR3_POSITION                 0x00000003
#define _RPINR25_COFSR3_MASK                     0x00000008
#define _RPINR25_COFSR3_LENGTH                   0x00000001

#define _RPINR25_COFSR4_POSITION                 0x00000004
#define _RPINR25_COFSR4_MASK                     0x00000010
#define _RPINR25_COFSR4_LENGTH                   0x00000001

#define _RPINR25_COFSR5_POSITION                 0x00000005
#define _RPINR25_COFSR5_MASK                     0x00000020
#define _RPINR25_COFSR5_LENGTH                   0x00000001

#define _RPINR25_COFSR6_POSITION                 0x00000006
#define _RPINR25_COFSR6_MASK                     0x00000040
#define _RPINR25_COFSR6_LENGTH                   0x00000001

#define _RPINR27_U3RXR_POSITION                  0x00000000
#define _RPINR27_U3RXR_MASK                      0x0000007F
#define _RPINR27_U3RXR_LENGTH                    0x00000007

#define _RPINR27_U3CTSR_POSITION                 0x00000008
#define _RPINR27_U3CTSR_MASK                     0x00007F00
#define _RPINR27_U3CTSR_LENGTH                   0x00000007

#define _RPINR27_U3RXR0_POSITION                 0x00000000
#define _RPINR27_U3RXR0_MASK                     0x00000001
#define _RPINR27_U3RXR0_LENGTH                   0x00000001

#define _RPINR27_U3RXR1_POSITION                 0x00000001
#define _RPINR27_U3RXR1_MASK                     0x00000002
#define _RPINR27_U3RXR1_LENGTH                   0x00000001

#define _RPINR27_U3RXR2_POSITION                 0x00000002
#define _RPINR27_U3RXR2_MASK                     0x00000004
#define _RPINR27_U3RXR2_LENGTH                   0x00000001

#define _RPINR27_U3RXR3_POSITION                 0x00000003
#define _RPINR27_U3RXR3_MASK                     0x00000008
#define _RPINR27_U3RXR3_LENGTH                   0x00000001

#define _RPINR27_U3RXR4_POSITION                 0x00000004
#define _RPINR27_U3RXR4_MASK                     0x00000010
#define _RPINR27_U3RXR4_LENGTH                   0x00000001

#define _RPINR27_U3RXR5_POSITION                 0x00000005
#define _RPINR27_U3RXR5_MASK                     0x00000020
#define _RPINR27_U3RXR5_LENGTH                   0x00000001

#define _RPINR27_U3RXR6_POSITION                 0x00000006
#define _RPINR27_U3RXR6_MASK                     0x00000040
#define _RPINR27_U3RXR6_LENGTH                   0x00000001

